INSERT INTO test.problem_record (problem_category,problem_name,difficulty,try_times,success_times,create_time,update_time,remark) VALUES
	 ('leetcode','1.两数之和','简单',2,2,'2023-12-18 18:45:42','2023-11-01 00:00:00',NULL),
	 ('leetcode','2.两数相加','中等',3,3,'2023-12-18 18:45:42','2023-11-01 00:00:00',NULL),
	 ('leetcode','3.无重复字符的最长子串','中等',3,3,'2023-12-18 18:45:42','2023-11-01 00:00:00',NULL),
	 ('leetcode','5.最长回文子串','中等',3,3,'2023-12-18 18:45:42','2023-11-01 00:00:00',NULL),
	 ('leetcode','11.盛最多水的容器','中等',3,3,'2023-12-18 18:45:42','2023-11-01 00:00:00',NULL),
	 ('leetcode','15.三数之和','中等',3,3,'2023-12-18 18:45:42','2023-11-01 00:00:00',NULL),
	 ('leetcode','17.电话号码的字母组合','中等',3,3,'2023-12-18 18:45:42','2023-11-01 00:00:00',NULL),
	 ('leetcode','19.删除链表的倒数第N个结点','中等',3,3,'2023-12-18 18:45:42','2023-11-01 00:00:00',NULL),
	 ('leetcode','20.有效的括号','简单',2,2,'2023-12-18 18:45:42','2023-11-01 00:00:00',NULL),
	 ('leetcode','21.合并两个有序链表','简单',2,2,'2023-12-18 18:45:42','2023-11-01 00:00:00',NULL);
INSERT INTO test.problem_record (problem_category,problem_name,difficulty,try_times,success_times,create_time,update_time,remark) VALUES
	 ('leetcode','22.括号生成','中等',4,3,'2023-12-18 18:45:42','2023-11-01 00:00:00',NULL),
	 ('leetcode','31.下一个排列','中等',4,3,'2023-12-18 18:45:42','2023-11-01 00:00:00',NULL),
	 ('leetcode','33.搜索旋转排序数组','中等',4,3,'2023-12-18 18:45:42','2023-11-01 00:00:00',NULL),
	 ('leetcode','34.在排序数组中查找元素的第一个和最后一个位置','中等',3,3,'2023-12-18 18:45:42','2023-11-01 00:00:00',NULL),
	 ('leetcode','35.搜索插入位置','简单',2,2,'2023-12-18 18:45:42','2023-11-01 00:00:00',NULL),
	 ('leetcode','39.组合总和','中等',4,3,'2023-12-18 18:45:42','2023-12-12 00:00:00',NULL),
	 ('leetcode','46.全排列','中等',3,3,'2023-12-18 18:45:42','2023-12-11 00:00:00',NULL),
	 ('leetcode','48.旋转图像','中等',3,3,'2023-12-18 18:45:42','2023-12-11 00:00:00',NULL),
	 ('leetcode','49.字母异位词分组','中等',3,3,'2023-12-18 18:45:42','2023-12-14 00:00:00',NULL),
	 ('leetcode','53.最大子数组和','中等',3,3,'2023-12-18 18:45:42','2023-12-12 00:00:00',NULL);
INSERT INTO test.problem_record (problem_category,problem_name,difficulty,try_times,success_times,create_time,update_time,remark) VALUES
	 ('leetcode','55.跳跃游戏','中等',3,3,'2023-12-18 18:45:42','2023-12-11 00:00:00',NULL),
	 ('leetcode','56.合并区间','中等',2,1,'2023-12-18 18:45:42','2023-12-11 00:00:00',NULL),
	 ('leetcode','62.不同路径','中等',2,2,'2023-12-18 18:45:42','2023-12-11 00:00:00',NULL),
	 ('leetcode','64.最小路径和','中等',3,2,'2023-12-18 18:45:42','2023-12-11 00:00:00',NULL),
	 ('leetcode','70.爬楼梯','简单',2,2,'2023-12-18 18:45:42','2023-11-02 00:00:00',NULL),
	 ('leetcode','72.编辑距离','中等',2,0,'2023-12-18 18:45:42','2023-12-11 00:00:00',NULL),
	 ('leetcode','75.颜色分类','中等',4,3,'2023-12-18 18:45:42','2023-12-13 00:00:00',NULL),
	 ('leetcode','78.子集','中等',3,3,'2023-12-18 18:45:42','2023-12-12 00:00:00',NULL),
	 ('leetcode','79.单词搜索','中等',4,3,'2023-12-18 18:45:42','2023-11-02 00:00:00',NULL),
	 ('leetcode','94.二叉树的中序遍历','简单',2,2,'2023-12-18 18:45:42','2023-11-02 00:00:00',NULL);
INSERT INTO test.problem_record (problem_category,problem_name,difficulty,try_times,success_times,create_time,update_time,remark) VALUES
	 ('leetcode','96.不同的二叉搜索树','中等',4,1,'2023-12-18 18:45:42','2023-12-12 00:00:00',NULL),
	 ('leetcode','98.验证二叉搜索树','中等',4,3,'2023-12-18 18:45:42','2023-12-13 00:00:00',NULL),
	 ('leetcode','101.对称二叉树','简单',2,2,'2023-12-18 18:45:42','2023-11-02 00:00:00',NULL),
	 ('leetcode','102.二叉树的层序遍历','中等',3,3,'2023-12-18 18:45:42','2023-12-14 00:00:00',NULL),
	 ('leetcode','104.二叉树的最大深度','简单',2,2,'2023-12-18 18:45:42','2023-11-02 00:00:00',NULL),
	 ('leetcode','105.从前序与中序遍历序列构造二叉树','中等',4,2,'2023-12-18 18:45:42','2023-12-19 09:59:09',NULL),
	 ('leetcode','108.将有序数组转换为二叉搜索树','简单',4,3,'2023-12-18 18:45:42','2023-12-19 18:33:12',NULL),
	 ('leetcode','114.二叉树展开为链表','中等',4,3,'2023-12-18 18:45:42','2023-12-14 00:00:00',NULL),
	 ('leetcode','118.杨辉三角','简单',3,2,'2023-12-18 18:45:42','2023-11-03 00:00:00',NULL),
	 ('leetcode','121.买卖股票的最佳时机','简单',3,3,'2023-12-18 18:45:42','2023-12-14 00:00:00',NULL);
INSERT INTO test.problem_record (problem_category,problem_name,difficulty,try_times,success_times,create_time,update_time,remark) VALUES
	 ('leetcode','122.买卖股票的最佳时机II','中等',1,0,'2023-12-18 18:45:42','2023-12-14 00:00:00',NULL),
	 ('leetcode','128.最长连续序列','中等',4,2,'2023-12-18 18:45:42','2023-12-14 00:00:00',NULL),
	 ('leetcode','136.只出现一次的数字','简单',2,2,'2023-12-18 18:45:42','2023-11-04 00:00:00',NULL),
	 ('leetcode','139.单词拆分','中等',3,2,'2023-12-18 18:45:42','2023-12-14 00:00:00',NULL),
	 ('leetcode','141.环形链表','简单',2,2,'2023-12-18 18:45:42','2023-11-04 00:00:00',NULL),
	 ('leetcode','142.环形链表II','中等',4,2,'2023-12-18 18:45:42','2023-12-13 00:00:00',NULL),
	 ('leetcode','146.LRU缓存','中等',3,2,'2023-12-18 18:45:42','2023-12-13 00:00:00',NULL),
	 ('leetcode','160.相交链表','简单',3,2,'2023-12-18 18:45:42','2023-11-04 00:00:00',NULL),
	 ('leetcode','169.多数元素','简单',2,2,'2023-12-18 18:45:42','2023-11-05 00:00:00',NULL),
	 ('leetcode','206.反转链表','简单',2,2,'2023-12-18 18:45:42','2023-11-05 00:00:00',NULL);
INSERT INTO test.problem_record (problem_category,problem_name,difficulty,try_times,success_times,create_time,update_time,remark) VALUES
	 ('leetcode','226.翻转二叉树','简单',2,2,'2023-12-18 18:45:42','2023-11-05 00:00:00',NULL),
	 ('leetcode','234.回文链表','简单',2,2,'2023-12-18 18:45:42','2023-11-05 00:00:00',NULL),
	 ('leetcode','283.移动零','简单',2,2,'2023-12-18 18:45:42','2023-11-05 00:00:00',NULL),
	 ('leetcode','338.比特位计数','简单',3,2,'2023-12-18 18:45:42','2023-11-05 00:00:00',NULL),
	 ('leetcode','448.找到所有数组中消失的数字','简单',2,2,'2023-12-18 18:45:42','2023-11-05 00:00:00',NULL),
	 ('leetcode','461.汉明距离','简单',2,2,'2023-12-18 18:45:42','2023-11-05 00:00:00',NULL),
	 ('leetcode','543.二叉树的直径','简单',3,2,'2023-12-18 18:45:42','2023-11-05 00:00:00',NULL),
	 ('leetcode','617.合并二叉树','简单',3,2,'2023-12-18 18:45:42','2023-11-05 00:00:00',NULL);
